# StairsTrisertypeTread Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeTread Property
ParameterTypeId Class See Also
---
"Tread"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeTread { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeTread As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeTread {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace